# 2020.11.13

# 인공지능 강의 5일차

=================================================================

## 탐색(Search) -> 문제 해결(문제 상태와 요구하는 목표 상태만으로 컴퓨터가 문제 해결)
### : 컴퓨터가 문제를 자율적으로 해결하기 위해 해 혹은 해에 이르기 위한 경로를 찾아가는 과정
 - 탐색은 인공지능적 문제해결에서 주요한 수단
 - 해를 찾는 과정의 효율성과 찾은 해의 적합성까지 포함
 - 인공지능 시스템에서 적용할 규칙을 선택하는 제어시스템의 행위는 일종의 탐색 과정

***동작(Operate)***

***상태(State)***


### 상태 공간(state space)
#### : 문제의 풀이과정 중의 고유한 요소(상황)
 - 상태의 집합을 상태 공간
 - 상태공간의 도입은 문제의 형식화에 유리 -> 트리 구조
 - 뿌리노드에서 목표노드까지 도달하는 과정
 - 트리에서의 노드의 재성성은 문제 야기 -> 그래프 구조

### 기본적 탐색기법
#### 경로 선택의 고려사항
 - 해의 경로는 짧아야 한다.
 - 탐색의 소요 경비는 적어야 한다.
 - 해가 있다면 탐색으로 반드시 찾아야 한다.
#### 탐색 기법으로 해결할 수 있는 문제 분류
 - 경로 발견 문제(8-puzzle), 게임(game) 문제(chess/바둑), 제약조건 만족(constraint satisfaction) 문제(8-queen)
#### 무작위 탐색
#### 트리에 의한 탐색 : 깊이 우선 탐색, 너비 우선 탐색

### 탐색의 방향 : 주어진 문제의 성격에 따라 좌우된다.
#### 전향 추론(forward reasoning) : 초기상태에서 목표상태로 탐색
#### 후향 추론(backward reasoning) : 목표상태에서 초기상태로 탐색

### 휴리스틱(heuristic) 기법 : 경험, feasible(O),  optimal(X)
#### : 논리적으로 혹은 수학적으로 중명X, 경험이나 직관에 의해 효율적으로 해를 얻을 수 있으리라는 기대를 갖게 하는 어떤 근거에 의한 방법. 최적의 해는 아니다.
### Travelling salesman problem
<img src=https://physics.aps.org/assets/a38de7c6-00ac-45fb-9bcf-3b3e14a72b41/es32_1.png/>

https://en.wikipedia.org/wiki/Travelling_salesman_problem

### 언덕등반기법
#### 평가함수 사용, 깊이 우선 탐색기법에 평가함수를 활용한 형태
 - 깊이 우선 탐색기법에 평가함수를 활용한 형태
 - 국부 최대가 존재할 수 있다.
 - 과정 회복 불가능
 - 8-퍼즐 문제

### 최고우선탐색
#### : 모든 말단 노드를 대상으로 평가함수 값을 비교하는 방법

### 빔 탐색
#### : 최고우선기법에서 기억노드의 수를 제한하는 방법. 기억공간이 축소되지만 너무 빠른 가지치기를 초래

### A-알고리즘
#### 최적의 경로 : 초기노드에서 목표노드까지의 최단 경로 임의의 노드 N의 평가함수를 정의

### A* 알고리즘

### 등등 나머지는 들어보기만 할 것

***유전자 알고리즘***

=================================================================

# Pandas 실습

In [1]:
import pandas as pd

In [54]:
# data frame : 데이터 자료
titanic_df = pd.read_csv('titanic_train.csv')
# titanic_df
titanic_df.head(3)


print('titanic 변수 type:',type(titanic_df))
print('--------------------------------------------------')
print('DataFrame 크기: ', titanic_df.shape)
print('--------------------------------------------------')
titanic_df.info()
# string은 object로 나온다. info로 null 값 확인이 중요하다.
# feature의 사용을 위해서 확인하는 습관이 중요하다.

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>
--------------------------------------------------
DataFrame 크기:  (891, 12)
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
# feature 중 한 개의 값을 셀 수 있다.
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('--------------------------------------------------')

titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))
print('--------------------------------------------------')

# print(titanic_pclass.head())

3    491
1    216
2    184
Name: Pclass, dtype: int64
--------------------------------------------------
<class 'pandas.core.series.Series'>
--------------------------------------------------

In [21]:
value_counts1 = titanic_df['SibSp'].value_counts()
print(value_counts1)
print('--------------------------------------------------')

value_count2 = titanic_df['Parch'].value_counts()
print(value_count2)
print('--------------------------------------------------')

# null 값은 카운팅 하지 않는다는 것을 알 수 있다.
# value_count3 = titanic_df['Cabin'].value_counts()
# print(value_count3)

value_count4 = titanic_df["Age"].Value_count()
print(value_count4)
print('--------------------------------------------------')

value_count5 = titanic_df["Sex"].Value_count()
print(value_count5)
print('--------------------------------------------------')

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64
--------------------------------------------------
male      577
female    314
Name: Sex, dtype: int64
--------------------------------------------------

### DataFrame 생성
### Dictionary를 DataFrame으로 변환
# 중요하다!!

In [24]:
import numpy as np
import os

dict1 = {'age':['young', 'young', 'middle', 'old', 'old'],
         'income':['high', 'high', 'high', 'mediym', 'low'],
         'student':['no', 'no', 'no', 'no', 'yes'],
         'credit':['fair', 'excellent', 'fair', 'fair', 'fair']}

#딕셔너리를 DataFrame으로 변환
data_df = pd.DataFrame(dict1)
print (data_df)
if not os.path.exists('news.csv'):      #파일 존재하지 않으면
    data_df.to_csv('news.csv', index=False, mode='w', encoding='utf-8-sig')  #파일 생성 mode='w' 한글 저장 encoding='utf-8-sig' 
else:
    data_df.to_csv('news.csv', header=False, index=False, mode='a', encoding='utf-8-sig') #파일에 추가 저장 mode='a'

      age  income student     credit
0   young    high      no       fair
1   young    high      no  excellent
2  middle    high      no       fair
3     old  mediym      no       fair
4     old     low     yes       fair

In [25]:
data_df = pd.DataFrame(dict1, index = [10, 20, 30, 40, 50])
print(data_df)

       age  income student     credit
10   young    high      no       fair
20   young    high      no  excellent
30  middle    high      no       fair
40     old  mediym      no       fair
50     old     low     yes       fair

# DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환

* 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

In [26]:
import numpy as np

col_name1=['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)

print('array1 shape:', array1.shape )
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)
print('--------------------------------------------------')
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)
print('--------------------------------------------------')

array1 shape: (3,)
1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3
--------------------------------------------------
1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3
--------------------------------------------------

In [29]:
# 3개의 컬럼명이 필요함. 
col_name2=['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트와 ndarray 생성 한 뒤 이를 DataFrame으로 변환. 
list2 = [[1, 2, 3],
         [11, 12, 13]]
array2 = np.array(list2)
print('array2 shape:', array2.shape )
print('--------------------------------------------------')


df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)
print('--------------------------------------------------')


df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array2)
print('--------------------------------------------------')

# Key는 컬럼명으로 매핑, Value는 리스트 형(또는 ndarray)
dict = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

array2 shape: (2, 3)
--------------------------------------------------
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
--------------------------------------------------
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
--------------------------------------------------
딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

* DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

* tolist() : 리스트로 변환
* to_dict('list') : 리스트 속성을 가지는 딕셔너리로 변환

In [30]:
# DataFrame을 ndarray로 변환
array3 = df_dict.values
# print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)
print('--------------------------------------------------')

# DataFrame을 리스트로 변환
list3 = df_dict.values.tolist()
# print('df_dict.values.tolist() 타입:', type(list3))
print(list3)
print('--------------------------------------------------')

# DataFrame을 딕셔너리로 변환
dict3 = df_dict.to_dict('list')
# print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

[[ 1  2  3]
 [11 22 33]]
--------------------------------------------------
[[1, 2, 3], [11, 22, 33]]
--------------------------------------------------
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### DataFrame의 컬럼 데이터 셋 Access

In [47]:
# 전부 다 0으로 초기화 된다.
titanic_df['Age_0']=0
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch']+1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_No,Age_0,Age_by_10
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,220.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,380.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,0,260.0

### DataFrame 데이터 삭제

In [48]:
# row : axis=0        column : axis=1
# titanic_drop_df = titanic_df.drop('Age_0', axis=1 )
# titanic_df = titanic_drop_df.drop('Age_by_10', axis=1 )
titanic_df = titanic_df.drop(['Age_0', 'Age_by_10'], axis=1)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1

In [55]:
# Row 삭제하는 방법이다.
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(5))
print('------------------------------------------------------')

titanic_df.drop([0,1,2], axis=0, inplace=True)

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
3            4         1       1  Futrelle, M...  female  35.0      1      0          113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450   8.0500   NaN        S
------------------------------------------------------
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

### Index 객체

In [56]:
# 원본 파일 재 로딩 
titanic_df = pd.read_csv('titanic_train.csv')

# Index 객체 추출
indexes = titanic_df.index
print(indexes)
print('------------------------------------------------------')

# Index 객체를 실제 값 arrray로 변환 
print('Index 객체 array값:\n',indexes.values)

RangeIndex(start=0, stop=891, step=1)
------------------------------------------------------
Index 객체 array값:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [58]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

# indexes의 값은 개별적으로 변경할 수 없다. 오류가 발생한다.
# indexes[0] = 5

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [60]:
series_fair = titanic_df['Fare']
print('Fair Series max 값:', series_fair.max())
print('Fair Series min 값:', series_fair.min())
print('Fair Series sum 값:', series_fair.sum())
print('sum() Fair Series:', sum(series_fair))
print('Fair Series + 3:\n',(series_fair + 3).head(3) )

Fair Series max 값: 512.3292
Fair Series min 값: 0.0
Fair Series sum 값: 28693.9493
sum() Fair Series: 28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [61]:
# index reset도 가능하다.
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

### 데이터 셀렉션 및 필터링

* DataFrame의 [ ] 연산자

In [62]:
print('단일 컬럼 데이터 추출:\n', titanic_df[ 'Pclass' ].head(3))
print('\n여러 컬럼들의 데이터 추출:\n', titanic_df[ ['Survived', 'Pclass'] ].head(3))
# print('[ ] 안에 숫자 index는 KeyError 오류 발생:\n', titanic_df[0])

단일 컬럼 데이터 추출:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

여러 컬럼들의 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

In [63]:
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [64]:
titanic_df[ titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

* DataFrame ix[] 연산자

지금은 쓰지 않는 기술이다. 굳이 보지 말자.

### Dictionary 데이터 인덱스 값 바꾸기

In [73]:
data = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one','two','three','four'])
print(data_df)
print('------------------------------------------------------')
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male
------------------------------------------------------

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

* 명칭 기반 인덱싱과 위치 기반 인덱싱의 구분

In [74]:
# data_df 를 reset_index() 로 새로운 숫자형 인덱스를 생성
data_df_reset = data_df.reset_index()
print(data_df_reset)
print('------------------------------------------------------')

# 새로운 Column을 만든셈이다.
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})
print(data_df_reset)
print('------------------------------------------------------')

# index 값에 1을 더해서 1부터 시작하는 새로운 index값 생성
data_df_reset.index = data_df_reset.index+1
data_df_reset
print(data_df_reset)

   index      Name  Year  Gender
0    one   Chulmin  2011    Male
1    two  Eunkyung  2016  Female
2  three  Jinwoong  2015    Male
3   four   Soobeom  2015    Male
------------------------------------------------------
  old_index      Name  Year  Gender
0       one   Chulmin  2011    Male
1       two  Eunkyung  2016  Female
2     three  Jinwoong  2015    Male
3      four   Soobeom  2015    Male
------------------------------------------------------
  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

* DataFrame iloc[ ] 연산자

In [78]:
print(data_df.iloc[0, 0])
print(data_df_reset.iloc[0, 1])

# 다음과 같이 사용하면 오류가 발생한다.
# data_df.iloc[0, 'Name'] : 0에 값이 없다.
# data_df.iloc['one', 0] : 0이라는 컬럼이 없다.

Chulmin
Chulmin

* DataFrame loc[ ] 연산자

In [80]:
# 이렇게는 사용 가능하다.
print(data_df.loc['one', 'Name'])
print(data_df_reset.loc[1, 'Name'])
print(data_df_reset.loc[1:2 , 'Name'])

Chulmin
Chulmin
1     Chulmin
2    Eunkyung
Name: Name, dtype: object

* 불린 인덱싱

In [85]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))
titanic_boolean.head(3)

<class 'pandas.core.frame.DataFrame'>

    PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch      Ticket     Fare Cabin Embarked
33           34         0       2  Wheadon, Mr...  male  66.0      0      0  C.A. 24579  10.5000   NaN        S
54           55         0       1  Ostby, Mr. ...  male  65.0      0      1      113509  61.9792   B30        C
96           97         0       1  Goldschmidt...  male  71.0      0      0    PC 17754  34.6542    A5        C

In [86]:
# loc을 사용해도 똑같다.
print(titanic_df[titanic_df['Age'] > 60][['Name','Age']].head(3))
print(titanic_df.loc[titanic_df['Age'] > 60, ['Name','Age']].head(3))

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0
              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [105]:
# 한줄 표현은 가독성이 떨어진다.
# print(titanic_df[ (titanic_df['Age'] > 60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')])
# print('-----------------------------------------------------------------------------------')

# 가독성도 중요하다.
cond = titanic_df['Age'] < 40
cond1 = 20 < titanic_df['Age']
cond2 = titanic_df['Survived']==0
cond3 = titanic_df['Sex']=='male'
print(titanic_df[cond & cond1 & cond2 & cond3])
print('-----------------------------------------------------------------------------------')

cond3 = titanic_df['Sex']=='female'
print(titanic_df[cond & cond1 & cond2 & cond3])

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0              1         0       3  Braund, Mr....  male  22.0      1      0       A/5 21171   7.2500   NaN        S
4              5         0       3  Allen, Mr. ...  male  35.0      0      0          373450   8.0500   NaN        S
13            14         0       3  Andersson, ...  male  39.0      1      5          347082  31.2750   NaN        S
20            21         0       2  Fynney, Mr....  male  35.0      0      0          239865  26.0000   NaN        S
34            35         0       1  Meyer, Mr. ...  male  28.0      1      0        PC 17604  82.1708   NaN        C
..           ...       ...     ...             ...   ...   ...    ...    ...             ...      ...   ...      ...
881          882         0       3  Markun, Mr....  male  33.0      0      0          349257   7.8958   NaN        S
883          884         0       2  Banfield, M...  male  28.0      0      0  C.A./SOTON ...  10.5000   NaN        S
884          885         0       3  Sutehall, M...  male  25.0      0      0  SOTON/OQ 39...   7.0500   NaN        S
886          887         0       2  Montvila, R...  male  27.0      0      0          211536  13.0000   NaN        S
890          891         0       3  Dooley, Mr....  male  32.0      0      0          370376   7.7500   NaN        Q

[197 rows x 12 columns]
-----------------------------------------------------------------------------------
     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket      Fare    Cabin Embarked
18            19         0       3  Vander Plan...  female  31.0      1      0          345763   18.0000      NaN        S
41            42         0       2  Turpin, Mrs...  female  27.0      1      0           11668   21.0000      NaN        S
100          101         0       3  Petranec, M...  female  28.0      0      0          349245    7.8958      NaN        S
199          200         0       2  Yrois, Miss...  female  24.0      0      0          248747   13.0000      NaN        S
246          247         0       3  Lindahl, Mi...  female  25.0      0      0          347071    7.7750      NaN        S
251          252         0       3  Strom, Mrs....  female  29.0      1      1          347054   10.4625       G6        S
293          294         0       3  Haas, Miss....  female  24.0      0      0          349236    8.8500      NaN        S
312          313         0       2  Lahtinen, M...  female  26.0      1      1          250651   26.0000      NaN        S
357          358         0       2  Funk, Miss....  female  38.0      0      0          237671   13.0000      NaN        S
396          397         0       3  Olsson, Mis...  female  31.0      0      0          350407    7.8542      NaN        S
402          403         0       3  Jussila, Mi...  female  21.0      1      0            4137    9.8250      NaN        S
423          424         0       3  Danbom, Mrs...  female  28.0      1      1          347080   14.4000      NaN        S
436          437         0       3  Ford, Miss....  female  21.0      2      2      W./C. 6608   34.3750      NaN        S
474          475         0       3  Strandberg,...  female  22.0      0      0            7553    9.8375      NaN        S
498          499         0       1  Allison, Mr...  female  25.0      1      2          113781  151.5500  C22 C26        S
501          502         0       3  Canavan, Mi...  female  21.0      0      0          364846    7.7500      NaN        Q
503          504         0       3  Laitinen, M...  female  37.0      0      0            4135    9.5875      NaN        S
534          535         0       3  Cacic, Miss...  female  30.0      0      0          315084    8.6625      NaN        S
567          568         0       3  Palsson, Mr...  female  29.0      0      4          349909   21.0750      NaN        S
610          611         0       3  Andersson, ...  female  39.0      1      5          347082   31.2750      NaN        S
617          618         0       3  Lobb, Mrs. ...  female  26.0      1      0       A/5. 3336   16.1000      NaN        S
657          658         0       3  Bourke, Mrs...  female  32.0      1      1          364849   15.5000      NaN        Q
729          730         0       3  Ilmakangas,...  female  25.0      1      0  STON/O2. 31...    7.9250      NaN        S
767          768         0       3  Mangan, Mis...  female  30.5      0      0          364850    7.7500      NaN        Q
799          800         0       3  Van Impe, M...  female  30.0      1      1          345773   24.1500      NaN        S
816          817         0       3  Heininen, M...  female  23.0      0      0  STON/O2. 31...    7.9250      NaN        S
882          883         0       3  Dahlberg, M...  female  22.0      0      0            7552   10.5167      NaN        S
885          886         0       3  Rice, Mrs. ...  female  39.0      0      5          382652   29.1250      NaN        Q